{
    "name": "Animalia",
    "commonName": "Reino Animal",
    "level": "Reino",
    "icon": "🌍",
    "description": "El Reino Animalia agrupa a organismos eucariotas, multicelulares y heterótrofos. Sus células carecen de pared celular. La mayoría de los animales son móviles, tienen un sistema nervioso y se reproducen sexualmente. Abarca desde invertebrados simples como las esponjas hasta los vertebrados más complejos.",
    "funFact": "El animal más grande del mundo, la ballena azul, tiene un corazón que pesa casi 700 kg, ¡el tamaño de un coche pequeño!",
    "tooltipText": "Abarca desde esponjas microscópicas hasta la ballena azul.",
    "imagen": "images/animalia.jpg",
    "children": [
        {
            "name": "Arthropoda",
            "commonName": "Artrópodos",
            "level": "Filo",
            "icon": "🐜",
            "description": "Es el filo más numeroso y diverso del reino animal, representando más del 80% de todas las especies conocidas. Se caracterizan por tener un exoesqueleto de quitina que deben mudar para crecer, un cuerpo segmentado y apéndices articulados. Incluye a los insectos, arácnidos, crustáceos y miriápodos.",
            "funFact": "Los artrópodos deben 'mudar' su exoesqueleto para poder crecer. Durante este proceso, llamado ecdisis, son extremadamente vulnerables a los depredadores.",
            "tooltipText": "El grupo más exitoso, con más de un millón de especies descritas.",
            "imagen": "images/arthropoda.jpg",
            "children": [
                {
                    "name": "Arachnida",
                    "commonName": "Arácnidos",
                    "level": "Clase",
                    "icon": "🕷️",
                    "description": "Los arácnidos son una clase de artrópodos quelicerados que incluye a las arañas, escorpiones, opiliones, garrapatas y ácaros. Se distinguen por tener el cuerpo dividido en dos regiones principales (tagmas): el prosoma (o cefalotórax) y el opistosoma (o abdomen). Poseen cuatro pares de patas locomotoras, carecen de antenas y alas, y presentan apéndices especializados como los quelíceros (para alimentarse o inyectar veneno) y los pedipalpos (con funciones sensoriales, defensivas o reproductivas).",
                    "funFact": "No todas las arañas tejen telarañas para cazar. Algunas, como las arañas lobo, cazan activamente a sus presas, mientras que otras, como las arañas saltarinas, tienen una visión tetracromática excelente y acechan antes de saltar sobre sus víctimas.",
                    "importanciaAgricola": "Tienen un rol dual fundamental. Las arañas son depredadores generalistas y agentes de control biológico muy importantes, consumiendo grandes cantidades de insectos plaga. Por otro lado, los ácaros (orden Acari) incluyen algunas de las plagas más devastadoras para los cultivos, como la araña roja, y las garrapatas son vectores de enfermedades para el ganado.",
                    "tooltipText": "Ocho patas, sin antenas. Incluye arañas y escorpiones.",
                    "imagen": "images/arachnida.jpg"
                },
                {
                    "name": "Crustacea",
                    "commonName": "Crustáceos",
                    "level": "Clase",
                    "icon": "🦀",
                    "description": "Los crustáceos son un subfilo de artrópodos principalmente acuáticos, aunque algunos grupos como las cochinillas de la humedad han colonizado el medio terrestre. Incluyen formas tan conocidas como cangrejos, langostas, camarones y percebes. Se caracterizan por tener dos pares de antenas, un exoesqueleto calcificado que les proporciona gran dureza y apéndices birrámeos (divididos en dos ramas). Juegan un papel vital en las cadenas tróficas marinas y de agua dulce.",
                    "funFact": "Algunos crustáceos, como el camarón pistola, pueden cerrar su pinza tan rápido que crean una burbuja de cavitación. Al colapsar, esta burbuja genera un sonido de más de 200 decibelios, una onda de choque que aturde a su presa y una breve emisión de luz (sonoluminiscencia).",
                    "importanciaAgricola": "Su importancia agrícola directa es secundaria. Las cochinillas de la humedad (isópodos terrestres) pueden dañar plántulas en semilleros con alta humedad al alimentarse de sus raíces tiernas. Sin embargo, su principal relevancia económica radica en la acuicultura y la pesca comercial.",
                    "tooltipText": "Los 'insectos del mar', como cangrejos y camarones.",
                    "imagen": "images/crustacea.jpg"
                },
                {
                    "name": "Insecta",
                    "commonName": "Insectos",
                    "level": "Clase",
                    "icon": "🦋",
                    "description": "La clase Insecta es el grupo de organismos más diverso y abundante de la Tierra, con más de un millón de especies descritas. Su anatomía se caracteriza por un cuerpo dividido en tres tagmas: cabeza, tórax y abdomen. La cabeza porta un par de antenas, ojos compuestos y las piezas bucales. El tórax, dividido en protórax, mesotórax y metatórax, soporta tres pares de patas y, en la mayoría de los adultos, uno o dos pares de alas. Su éxito evolutivo se atribuye a su pequeño tamaño, alta capacidad reproductiva, la habilidad para volar y su increíble capacidad de adaptación a casi todos los nichos ecológicos terrestres y de agua dulce.",
                    "funFact": "Los insectos son el único grupo de invertebrados que ha desarrollado la capacidad de volar. Esta innovación evolutiva, ocurrida hace más de 300 millones de años, les permitió escapar de depredadores, dispersarse a nuevos hábitats y acceder a recursos alimenticios inaccesibles para otros organismos terrestres, siendo un factor clave en su extraordinaria diversificación.",
                    "importanciaAgricola": "Los insectos tienen el impacto más profundo y dual en la agricultura. Por un lado, son responsables de pérdidas masivas de cultivos como plagas directas (masticadores, chupadores, barrenadores) y como vectores de enfermedades virales y bacterianas. Por otro lado, son indispensables como polinizadores (asegurando la producción de frutas y semillas), agentes de control biológico (depredadores y parasitoides) y recicladores de materia orgánica en el suelo.",
                    "tooltipText": "Seis patas y, usualmente, alas. El grupo más diverso del planeta.",
                    "imagen": "images/insecta.jpg",
                    "children": [
                        {
                            "name": "CompleteClassification",
                            "commonName": "Clasificación Completa de Órdenes",
                            "level": "Agrupación",
                            "icon": "📚",
                            "description": "Contiene los 28 órdenes de insectos para una referencia taxonómica exhaustiva.",
                            "children": [
                                { "name": "Archaeognatha", "commonName": "Arqueognatos", "level": "Orden", "icon": "🦗", "description": "Insectos primitivos sin alas (ápteros) con cuerpo cilíndrico y tres apéndices caudales largos. Sus ojos compuestos son grandes y se tocan en la línea media de la cabeza. Poseen la habilidad única de saltar flexionando su abdomen, lo que los diferencia de otros insectos primitivos. Son considerados fósiles vivientes.", "importanciaAgricola": "No tienen importancia agrícola directa. Son detritívoros, alimentándose de algas, líquenes y materia orgánica en descomposición, contribuyendo al reciclaje de nutrientes en ecosistemas naturales.", "imagen": "images/archaeognatha.jpg", "funFact": "Pueden saltar hasta 25 cm de altura, una distancia impresionante para su pequeño tamaño." },
                                { "name": "Zygentoma", "commonName": "Zigéntomos", "level": "Orden", "icon": "🐜", "description": "Conocidos como pececillos de plata, son insectos ápteros con el cuerpo aplanado y cubierto de escamas que les dan un brillo metálico. Son de hábitos nocturnos y se mueven con gran rapidez. Se encuentran comúnmente en ambientes húmedos y oscuros, tanto en la naturaleza como en viviendas.", "importanciaAgricola": "Considerados plagas domésticas y de almacenamiento. Pueden dañar productos que contienen almidón o celulosa, como papel, encuadernaciones de libros, telas de algodón y alimentos secos. Su impacto en cultivos de campo es nulo.", "imagen": "images/zygentoma.jpg", "funFact": "Pueden vivir varios años y sobrevivir meses sin alimentarse." },
                                { "name": "Ephemeroptera", "commonName": "Efeméridas", "level": "Orden", "icon": "🦟", "description": "Insectos con ninfas acuáticas que respiran por branquias traqueales. Los adultos tienen una vida extremadamente corta (de horas a pocos días) y no se alimentan, ya que su aparato bucal está atrofiado. Son un eslabón fundamental en las cadenas tróficas de agua dulce.", "importanciaAgricola": "No tienen impacto agrícola directo. Son excelentes bioindicadores de la calidad del agua; su presencia indica ecosistemas acuáticos saludables y poco contaminados, lo cual es vital para la agricultura que depende de fuentes de agua limpias.", "imagen": "images/ephemeroptera.jpg", "funFact": "Son los únicos insectos que mudan una vez más después de haber desarrollado alas funcionales." },
                                { "name": "Odonata", "commonName": "Odonatos", "level": "Orden", "icon": "🦗", "description": "Este orden incluye a las libélulas y los caballitos del diablo. Son depredadores aéreos muy eficientes, con grandes ojos compuestos que les otorgan una visión panorámica. Sus dos pares de alas membranosas y fuertes les permiten un vuelo ágil, rápido y controlado. Sus ninfas son acuáticas y también depredadoras voraces.", "importanciaAgricola": "Altamente beneficiosos. Tanto adultos como ninfas son depredadores de una gran variedad de insectos, incluyendo plagas como mosquitos, moscas y pequeñas orugas. Actúan como valiosos controladores biológicos naturales en ecosistemas agrícolas y humedales.", "imagen": "images/odonata.jpg", "funFact": "Las libélulas pueden volar hacia atrás, flotar en el aire como un helicóptero y alcanzar velocidades de hasta 50 km/h." },
                                { "name": "Plecoptera", "commonName": "Plecópteros", "level": "Orden", "icon": "🦗", "description": "Conocidos como moscas de las piedras, sus ninfas son acuáticas y se desarrollan en aguas frías, limpias y bien oxigenadas. Los adultos tienen dos pares de alas membranosas que pliegan sobre el abdomen en reposo. Son malos voladores y suelen permanecer cerca de los cuerpos de agua.", "importanciaAgricola": "Sin importancia agrícola directa. Al igual que las efemérides, son bioindicadores clave de la salud de los ecosistemas fluviales, importantes para la gestión de cuencas hidrográficas que proveen agua para el riego.", "imagen": "images/plecoptera.jpg", "funFact": "Muchas especies se comunican tamborileando su abdomen contra superficies, creando vibraciones para atraer a sus parejas." },
                                { "name": "Dermaptera", "commonName": "Dermápteros", "level": "Orden", "icon": "🐜", "description": "Las tijeretas se caracterizan por tener un par de cercos en forma de pinza o tijera al final del abdomen, que usan para la defensa, cortejo y manipulación de presas. Son de hábitos nocturnos y omnívoros, refugiándose en lugares húmedos y oscuros durante el día.", "importanciaAgricola": "Tienen un rol dual. Pueden ser plagas menores al alimentarse de plántulas, flores y frutos blandos. Sin embargo, también son beneficiosas al depredar pulgones, ácaros, huevos de insectos y pequeñas orugas, por lo que su manejo debe ser cuidadoso.", "imagen": "images/dermaptera.jpg", "funFact": "Las hembras de tijereta exhiben un cuidado maternal notable, protegiendo y limpiando sus huevos hasta que eclosionan." },
                                { "name": "Orthoptera", "commonName": "Ortópteros", "level": "Orden", "icon": "🦗", "description": "Agrupa a saltamontes, grillos, langostas y esperanzas. Se caracterizan por su tercer par de patas adaptado para el salto (fémures engrosados) y su aparato bucal masticador. Muchas especies producen sonidos (estridulación) para la comunicación y el cortejo.", "importanciaAgricola": "Incluye algunas de las plagas más devastadoras a nivel mundial, como las langostas, que en fases gregarias pueden formar enjambres y destruir cultivos enteros en cuestión de horas. Otros, como los grillos, pueden dañar plántulas y raíces.", "imagen": "images/orthoptera.jpg", "funFact": "Los grillos tienen sus 'oídos' (órganos timpánicos) en las rodillas de sus patas delanteras." },
                                { "name": "Phasmatodea", "commonName": "Fásmidos", "level": "Orden", "icon": "🦗", "description": "Conocidos como insectos palo e insectos hoja, son maestros del camuflaje, imitando a la perfección ramas, cortezas u hojas. Son herbívoros y de movimientos lentos para pasar desapercibidos ante los depredadores. La mayoría de las especies son tropicales.", "importanciaAgricola": "Generalmente de baja importancia. En condiciones de altas densidades poblacionales, que son raras, pueden causar defoliación en árboles forestales o cultivos perennes, pero rara vez se consideran plagas significativas.", "imagen": "images/phasmatodea.jpg", "funFact": "Algunas especies pueden desprenderse de sus patas para escapar de los depredadores, un proceso llamado autotomía, y pueden regenerarlas en mudas posteriores." },
                                { "name": "Embioptera", "commonName": "Embiópteros", "level": "Orden", "icon": "🐜", "description": "Conocidos como tejedores, son insectos gregarios que viven en galerías de seda que construyen en el suelo, la hojarasca o bajo la corteza de los árboles. Las hembras no tienen alas, mientras que los machos sí. Se alimentan de materia vegetal muerta, líquenes y musgos.", "importanciaAgricola": "Sin importancia agrícola directa. Son descomponedores que contribuyen al ciclo de nutrientes en el suelo, un rol beneficioso para la salud general del ecosistema.", "imagen": "images/embioptera.jpg", "funFact": "Producen la seda con glándulas especiales ubicadas en sus patas delanteras." },
                                { "name": "Grylloblattodea", "commonName": "Grilloblatodeos", "level": "Orden", "icon": "🦗", "description": "Insectos extremadamente raros y primitivos que viven en ambientes muy fríos como cuevas de hielo y bordes de glaciares en el hemisferio norte. Son ápteros, de hábitos nocturnos y omnívoros, alimentándose de otros artrópodos muertos.", "importanciaAgricola": "Sin ninguna importancia agrícola debido a su hábitat tan específico y restringido.", "imagen": "images/grylloblattodea.jpg", "funFact": "Tienen uno de los metabolismos más lentos del mundo de los insectos y pueden tardar hasta 7 años en alcanzar la madurez." },
                                { "name": "Mantophasmatodea", "commonName": "Mantofasmatodeos", "level": "Orden", "icon": "🦗", "description": "Un orden descubierto en el siglo XXI, conocidos como 'gladiadores'. Son insectos depredadores y ápteros que se encuentran principalmente en el sur de África. Su apariencia es una mezcla entre una mantis y un insecto palo.", "importanciaAgricola": "Sin ninguna importancia agrícola conocida.", "imagen": "images/mantophasmatodea.jpg", "funFact": "Fueron identificados por primera vez a partir de especímenes conservados en museos que tenían casi 100 años." },
                                { "name": "Mantodea", "commonName": "Mantodeos", "level": "Orden", "icon": "🦗", "description": "Las mantis son depredadores voraces, famosas por su primer par de patas raptoras, modificadas para atrapar y sujetar a sus presas. Tienen una cabeza triangular con gran movilidad, lo que les permite un amplio campo de visión para localizar a sus víctimas. Son maestras del camuflaje.", "importanciaAgricola": "Muy beneficiosos. Son depredadores generalistas de una amplia gama de insectos, incluyendo muchas plagas agrícolas como pulgones, moscas, orugas y saltamontes. Son considerados excelentes agentes de control biológico.", "imagen": "images/mantodea.jpg", "funFact": "La ooteca, o estuche de huevos, de una mantis puede contener hasta 200 huevos y es resistente a las inclemencias del tiempo." },
                                { "name": "Blattodea", "commonName": "Blatodeos", "level": "Orden", "icon": "🐜", "description": "Este orden incluye a las cucarachas y las termitas. Las cucarachas suelen tener el cuerpo aplanado dorsoventralmente y son omnívoras. Las termitas son insectos sociales que viven en colonias organizadas con castas y son capaces de digerir la celulosa gracias a simbiontes en su intestino.", "importanciaAgricola": "Las termitas son plagas graves de la madera y pueden dañar estructuras agrícolas (postes, cercas) y cultivos leñosos como cítricos, café o aguacate. Algunas cucarachas son plagas en almacenes de granos y productos procesados.", "imagen": "images/blattodea.jpg", "funFact": "Una termita reina puede vivir hasta 50 años y poner miles de huevos al día." },
                                { "name": "Zoraptera", "commonName": "Zorápteros", "level": "Orden", "icon": "🐜", "description": "Insectos diminutos y raros que viven en colonias en madera en descomposición, bajo cortezas o en montículos de termitas. Se alimentan de esporas de hongos y pequeños artrópodos. Pueden ser alados o ápteros dentro de la misma colonia.", "importanciaAgricola": "Sin ninguna importancia agrícola.", "imagen": "images/zoraptera.png", "funFact": "A pesar de su nombre, que significa 'puramente sin alas', algunas formas tienen alas que luego se desprenden." },
                                { "name": "Psocodea", "commonName": "Psocópteros", "level": "Orden", "icon": "🐜", "description": "Grupo diverso que incluye formas de vida libre (piojos de los libros), que se alimentan de moho y detritos, y formas parásitas (piojos masticadores y chupadores) que viven en aves y mamíferos. Son generalmente pequeños y de cuerpo blando.", "importanciaAgricola": "Los piojos parásitos son de gran importancia veterinaria, afectando al ganado y aves de corral, causando estrés, irritación y reducción en la producción. Los piojos de los libros pueden infestar granos almacenados si las condiciones de humedad son altas.", "imagen": "images/psocodea.png", "funFact": "Los piojos de los libros no son verdaderos piojos; se llaman así por su hábito de encontrarse en papeles y libros viejos donde se alimentan de moho." },
                                { "name": "Thysanoptera", "commonName": "Tisanópteros", "level": "Orden", "icon": "🦟", "description": "Los trips son insectos diminutos y delgados, con alas plumosas muy características. Poseen un aparato bucal raspador-chupador asimétrico, único en su clase, con el que perforan los tejidos vegetales para alimentarse de su contenido celular. Se reproducen rápidamente.", "importanciaAgricola": "Muchas especies son plagas importantes que causan daño directo al alimentarse (decoloración, deformación de hojas y frutos) y, más críticamente, al actuar como vectores de virus vegetales devastadores (ej. Tospovirus). Afectan a una gran variedad de cultivos hortícolas, frutales y ornamentales.", "imagen": "images/thysanoptera.jpg", "funFact": "Algunas especies de trips pueden reproducirse por partenogénesis, es decir, las hembras pueden producir descendencia sin necesidad de un macho." },
                                { "name": "Hemiptera", "commonName": "Hemípteros", "level": "Orden", "icon": "🐞", "description": "Conocidos como 'chinches verdaderas', este es un orden muy grande y diverso que incluye pulgones, cigarras, moscas blancas y cochinillas. Su característica unificadora es un aparato bucal picador-chupador en forma de estilete, que usan para succionar savia de las plantas o fluidos de otros animales.", "importanciaAgricola": "De enorme importancia. Incluye muchísimas de las plagas más dañinas (pulgones, mosca blanca, cochinillas, chinches fitófagas) que debilitan las plantas al succionar savia y transmiten cientos de virus. Sin embargo, también hay especies beneficiosas como las chinches depredadoras que controlan otras plagas.", "imagen": "images/hemiptera.jpg", "funFact": "Las cigarras periódicas pueden vivir bajo tierra como ninfas durante 13 o 17 años antes de emerger como adultos." },
                                { "name": "Raphidioptera", "commonName": "Rafidiópteros", "level": "Orden", "icon": "🦟", "description": "Conocidos como moscas serpiente por su largo protórax, que les da la apariencia de una serpiente a punto de atacar. Tanto las larvas, que viven en el suelo o bajo la corteza, como los adultos son depredadores. Se encuentran en el hemisferio norte.", "importanciaAgricola": "Beneficiosos. Contribuyen al control biológico de insectos de cuerpo blando como pulgones y larvas de otros insectos en ecosistemas forestales y agrícolas cercanos a bosques.", "imagen": "images/raphidioptera.png", "funFact": "Las hembras tienen un ovipositor largo en forma de aguja que usan para depositar huevos en grietas de la corteza." },
                                { "name": "Megaloptera", "commonName": "Megalópteros", "level": "Orden", "icon": "🦟", "description": "Insectos de gran tamaño con larvas acuáticas depredadoras que pueden pasar varios años en el agua. Los adultos tienen mandíbulas prominentes, especialmente los machos, aunque no las usan para alimentarse. Son de vida corta y permanecen cerca del agua.", "importanciaAgricola": "Beneficiosos indirectamente. Sus larvas son depredadoras de otros invertebrados acuáticos y son importantes bioindicadores de la buena calidad del agua, esencial para la agricultura.", "imagen": "images/megaloptera.png", "funFact": "Las larvas de algunas especies, conocidas como 'hellgrammites', son una carnada muy popular para la pesca." },
                                { "name": "Neuroptera", "commonName": "Neurópteros", "level": "Orden", "icon": "🦋", "description": "Este orden incluye a las crisopas y las hormigas león. Los adultos se caracterizan por sus dos pares de alas membranosas con una venación muy abundante y reticulada. Sus larvas son depredadoras muy activas y voraces, con mandíbulas prominentes en forma de pinza.", "importanciaAgricola": "Extremadamente beneficiosos. Las larvas de crisopa, conocidas como 'leones de áfidos', son depredadores muy eficaces de pulgones, ácaros, cochinillas, trips y huevos de otros insectos. Se crían y liberan comercialmente para el control biológico de plagas.", "imagen": "images/neuroptera.jpg", "funFact": "Las larvas de hormiga león cavan trampas cónicas en la arena para atrapar hormigas y otros insectos que caen en ellas." },
                                { "name": "Coleoptera", "commonName": "Coleópteros", "level": "Orden", "icon": "🐞", "description": "Es el orden más grande de todos los seres vivos, conteniendo a los escarabajos y mariquitas. Su principal característica es tener el primer par de alas (élitros) endurecido, formando un estuche que protege el segundo par de alas membranosas y el abdomen. Presentan una diversidad asombrosa de formas, tamaños y hábitos.", "importanciaAgricola": "Importancia inmensa y variada. Incluye plagas devastadoras (gorgojos de granos, escarabajo de la papa, picudos que atacan el café), pero también grupos muy beneficiosos como las mariquitas (depredadoras de pulgones), los carábidos (depredadores de suelo) y los escarabajos coprófagos (recicladores de nutrientes).", "imagen": "images/coleoptera.jpg", "funFact": "El escarabajo bombardero puede disparar un chorro químico hirviente y tóxico desde su abdomen para defenderse de los depredadores." },
                                { "name": "Strepsiptera", "commonName": "Estresípteros", "level": "Orden", "icon": "🦟", "description": "Son endoparásitos de otros insectos. Los machos son alados, de vida libre y muy corta, mientras que las hembras son larviformes y permanecen dentro del insecto huésped durante toda su vida. Son un grupo muy especializado y poco común.", "importanciaAgricola": "Beneficiosos. Al parasitar a insectos de órdenes como Hemiptera (chinches, saltahojas) y Hymenoptera (avispas, abejas), pueden ayudar a regular poblaciones de algunas plagas agrícolas de forma natural.", "imagen": "images/strepsiptera.png", "funFact": "Los machos tienen ojos que parecen frambuesas, compuestos por unas pocas docenas de lentes grandes, a diferencia de los miles de lentes pequeños de otros insectos." },
                                { "name": "Mecoptera", "commonName": "Mecópteros", "level": "Orden", "icon": "🦟", "description": "Conocidos como moscas escorpión por los genitales curvados hacia arriba de los machos, que recuerdan a la cola de un escorpión (aunque son inofensivos). Tienen una cabeza con un 'pico' o rostro alargado. Generalmente se encuentran en áreas boscosas y húmedas.", "importanciaAgricola": "Poca o ninguna importancia agrícola directa. Generalmente se alimentan de insectos muertos o materia vegetal en descomposición, por lo que son saprófagos y no afectan a los cultivos.", "imagen": "images/mecoptera.png", "funFact": "Algunos machos ofrecen regalos nupciales (presas o saliva secretada) a las hembras para poder aparearse." },
                                { "name": "Siphonaptera", "commonName": "Sifonápteros", "level": "Orden", "icon": "🐜", "description": "Las pulgas son insectos sin alas, aplanados lateralmente y con patas adaptadas para saltar. Son ectoparásitos hematófagos obligados de mamíferos y aves. Sus larvas, sin embargo, se desarrollan en el ambiente (nidos, camas) alimentándose de detritos orgánicos.", "importanciaAgricola": "De importancia veterinaria. Afectan al ganado, animales de granja y domésticos, causando irritación, anemia y transmitiendo enfermedades y parásitos internos como las tenias. No son plagas directas de los cultivos.", "imagen": "images/siphonaptera.png", "funFact": "Una pulga puede saltar hasta 200 veces su propia altura, lo que la convierte en uno de los mejores saltadores del mundo animal en relación a su tamaño." },
                                { "name": "Diptera", "commonName": "Dípteros", "level": "Orden", "icon": "🦟", "description": "Este orden agrupa a moscas y mosquitos. Su nombre significa 'dos alas', ya que solo tienen un par de alas funcionales para el vuelo. El segundo par está modificado en estructuras llamadas balancines o halterios, que actúan como giroscopios para estabilizar el vuelo. Sus larvas (gusanos) ocupan una gran variedad de nichos.", "importanciaAgricola": "Gran importancia. Incluye plagas agrícolas graves (moscas de la fruta, minadores de hojas), y vectores de enfermedades para humanos y ganado (mosquitos, tábanos). Sin embargo, también hay grupos beneficiosos como los polinizadores (moscas de las flores) y agentes de control biológico (moscas sírfidas y taquínidas).", "imagen": "images/diptera.jpg", "funFact": "Las larvas de algunas moscas sírfidas imitan la apariencia y el comportamiento de las larvas de mariquita para evitar ser depredadas." },
                                { "name": "Trichoptera", "commonName": "Tricópteros", "level": "Orden", "icon": "🦋", "description": "Están estrechamente relacionados con los lepidópteros. Sus larvas son acuáticas y son famosas por construir estuches o refugios portátiles con seda y materiales del entorno (arena, ramitas, hojas). Los adultos son parecidos a polillas, pero con alas cubiertas de pelos en lugar de escamas.", "importanciaAgricola": "Ninguna importancia agrícola directa. Son importantes en los ecosistemas acuáticos como fuente de alimento para peces y como indicadores de la calidad del agua, lo que es relevante para la gestión de recursos hídricos para la agricultura.", "imagen": "images/trichoptera.png", "funFact": "Los diseños de los estuches de las larvas son tan específicos que a menudo se puede identificar la especie solo por su construcción." },
                                { "name": "Lepidoptera", "commonName": "Lepidópteros", "level": "Orden", "icon": "🦋", "description": "Este orden incluye a las mariposas y polillas. Se caracterizan por sus dos pares de alas anchas cubiertas de pequeñas escamas coloridas. Los adultos suelen tener un aparato bucal modificado en una espiritrompa enrollada para libar néctar. Sus larvas, conocidas como orugas, tienen un aparato bucal masticador y son principalmente herbívoras.", "importanciaAgricola": "Importancia dual crítica. Las larvas (orugas) son de las plagas más importantes a nivel mundial, causando defoliación y barrenado de frutos y tallos (ej. gusano cogollero en maíz, barrenadores del tallo en caña). Por otro lado, los adultos son polinizadores esenciales para muchos cultivos y plantas silvestres.", "imagen": "images/lepidoptera.jpg", "funFact": "La mariposa monarca realiza una de las migraciones más largas del mundo de los insectos, viajando hasta 4,000 km desde Canadá y EE. UU. hasta México para pasar el invierno." },
                                { "name": "Hymenoptera", "commonName": "Himenópteros", "level": "Orden", "icon": "🐝", "description": "Agrupa a abejas, avispas y hormigas. Es uno de los órdenes más evolucionados, con muchas especies que presentan un comportamiento social complejo. Tienen dos pares de alas membranosas (si están presentes) y un ovipositor que en muchos grupos se ha modificado en un aguijón para la defensa o para inyectar veneno.", "importanciaAgricola": "Fundamental. Incluye a los polinizadores más importantes (abejas), cruciales para la producción de la mayoría de frutas, hortalizas y semillas. También contiene a las avispas parasitoides, los agentes de control biológico más utilizados en el mundo, y a las hormigas, que pueden ser plagas (cortadoras de hojas) o beneficiosas (depredadoras).", "imagen": "images/hymenoptera.jpg", "funFact": "Las hormigas cortadoras de hojas no comen las hojas que cortan; las usan para cultivar un hongo específico en sus nidos, del cual se alimentan." }
                            ]
                        },
                        {
                            "name": "AgriculturalImportance",
                            "commonName": "Grupos de Importancia Agrícola",
                            "level": "Agrupación",
                            "icon": "🌾",
                            "description": "Contiene una selección de los órdenes con mayor impacto en la agricultura, incluyendo ácaros.",
                            "children": [
                                { "name": "Coleoptera", "commonName": "Coleópteros", "level": "Orden", "icon": "🐞", "importance": "agrícola", "description": "Es el orden más grande de todos los seres vivos (escarabajos, mariquitas). Su primer par de alas (élitros) está endurecido, formando un estuche que protege el segundo par de alas membranosas y el abdomen. Presentan una diversidad asombrosa de formas, tamaños y hábitos.", "agriculturalImportance": "Importancia inmensa y variada. Incluye plagas devastadoras (gorgojos, picudos) y grandes benefactores (mariquitas).", "imagen": "images/coleoptera.jpg", "funFact": "El escarabajo bombardero puede disparar un chorro químico hirviente y tóxico desde su abdomen para defenderse de los depredadores." },
                                { "name": "Hemiptera", "commonName": "Hemípteros", "level": "Orden", "icon": "🐞", "importance": "agrícola", "description": "Incluye pulgones, cigarras, moscas blancas y cochinillas. Su característica común es un aparato bucal picador-chupador para succionar savia.", "agriculturalImportance": "Enorme importancia. Incluye muchísimas de las plagas más dañinas que debilitan las plantas y transmiten virus.", "imagen": "images/hemiptera.jpg", "funFact": "Las cigarras periódicas pueden vivir bajo tierra como ninfas durante 13 o 17 años antes de emerger como adultos." },
                                { "name": "Thysanoptera", "commonName": "Tisanópteros", "level": "Orden", "icon": "🦟", "importance": "agrícola", "description": "Los trips son insectos diminutos y delgados, con alas plumosas. Poseen un aparato bucal raspador-chupador con el que perforan los tejidos vegetales.", "agriculturalImportance": "Son plagas importantes que dañan plantas y actúan como vectores de virus vegetales devastadores.", "imagen": "images/thysanoptera.jpg", "funFact": "Algunas especies de trips pueden reproducirse por partenogénesis, es decir, las hembras pueden producir descendencia sin necesidad de un macho." },
                                { "name": "Diptera", "commonName": "Dípteros", "level": "Orden", "icon": "🦟", "importance": "agrícola", "description": "Agrupa a moscas y mosquitos. Tienen un solo par de alas funcionales; el segundo está modificado en balancines (halterios) para el equilibrio.", "agriculturalImportance": "Gran importancia. Incluye plagas (moscas de la fruta), vectores de enfermedades, pero también polinizadores y controladores biológicos.", "imagen": "images/diptera.jpg", "funFact": "Las larvas de algunas moscas sírfidas imitan la apariencia y el comportamiento de las larvas de mariquita para evitar ser depredadas." },
                                { "name": "Lepidoptera", "commonName": "Lepidópteros", "level": "Orden", "icon": "🦋", "importance": "agrícola", "description": "Incluye a las mariposas y polillas. Sus larvas (orugas) tienen un aparato bucal masticador, mientras que los adultos suelen tener una espiritrompa para libar néctar.", "agriculturalImportance": "Importancia dual crítica. Las larvas (orugas) son de las plagas más importantes. Los adultos son polinizadores esenciales.", "imagen": "images/lepidoptera.jpg", "funFact": "La mariposa monarca realiza una de las migraciones más largas del mundo de los insectos, viajando hasta 4,000 km desde Canadá y EE. UU. hasta México para pasar el invierno." },
                                { "name": "Orthoptera", "commonName": "Ortópteros", "level": "Orden", "icon": "🦗", "importance": "agrícola", "description": "Agrupa a saltamontes, grillos y langostas. Se caracterizan por su tercer par de patas adaptado para el salto y su aparato bucal masticador.", "agriculturalImportance": "Incluye plagas devastadoras como las langostas, que pueden destruir cultivos enteros.", "imagen": "images/orthoptera.jpg", "funFact": "Los grillos tienen sus 'oídos' (órganos timpánicos) en las rodillas de sus patas delanteras." },
                                { "name": "Hymenoptera", "commonName": "Himenópteros", "level": "Orden", "icon": "🐝", "importance": "agrícola", "description": "Agrupa a abejas, avispas y hormigas. Muchas especies presentan un comportamiento social complejo. El ovipositor a menudo se modifica en un aguijón.", "agriculturalImportance": "Fundamental. Incluye a los polinizadores más importantes (abejas), cruciales para la producción de la mayoría de frutas, hortalizas y semillas. También contiene a las avispas parasitoides, los agentes de control biológico más utilizados, y a las hormigas, que pueden ser plagas o beneficiosas.", "imagen": "images/hymenoptera.jpg", "funFact": "Las hormigas cortadoras de hojas no comen las hojas que cortan; las usan para cultivar un hongo específico en sus nidos, del cual se alimentan." },
                                { "name": "Acari", "commonName": "Ácaros", "level": "Orden", "icon": "🕷️", "importance": "agrícola", "description": "Aunque los ácaros no son insectos (pertenecen a la clase Arachnida), se incluyen aquí por su enorme importancia agrícola. Incluyen plagas devastadoras como la araña roja y el ácaro blanco, que causan daños severos al succionar el contenido celular de las hojas. Las garrapatas también afectan gravemente al ganado.", "agriculturalImportance": "De enorme importancia. Incluye algunas de las plagas más destructivas y difíciles de controlar, como la araña roja (Tetranychus urticae) y el ácaro blanco (Polyphagotarsonemus latus).", "imagen": "images/acari.jpg", "funFact": "Algunos ácaros son tan pequeños que pueden viajar por el aire como 'plancton aéreo', dispersándose a grandes distancias con el viento." }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Mollusca", "commonName": "Moluscos", "level": "Filo", "icon": "🐌", "description": "Es el segundo filo más numeroso. Son animales de cuerpo blando, a menudo protegido por una concha calcárea. Incluyen una gran diversidad de formas y hábitats, desde terrestres hasta abisales.", "funFact": "El calamar gigante (Architeuthis dux) tiene los ojos más grandes del reino animal, ¡pueden llegar a tener el tamaño de un plato! Esto les ayuda a ver en la oscuridad de las profundidades oceánicas.", "tooltipText": "Cuerpo blando, a menudo con concha. Incluye caracoles y pulpos.", "imagen": "images/mollusca.jpg",
            "children": [
                { "name": "Gastropoda", "commonName": "Gasterópodos", "level": "Clase", "icon": "🐌", "description": "Incluye a caracoles y babosas. La mayoría tiene una concha en espiral y un pie muscular para moverse. Son el grupo más grande de moluscos.", "funFact": "Algunos caracoles marinos del género Conus cazan usando un 'arpón' venenoso que puede ser fatal incluso para los humanos, convirtiéndolos en uno de los moluscos más peligrosos.", "agriculturalImportance": "Algunas especies de caracoles y babosas son plagas importantes en horticultura y jardinería.", "imagen": "images/gastropoda.jpg" },
                { "name": "Bivalvia", "commonName": "Bivalvos", "level": "Clase", "icon": "🦪", "description": "Incluye ostras, almejas y mejillones. Tienen una concha de dos valvas unidas por un ligamento. Son filtradores y juegan un papel clave en la limpieza del agua.", "funFact": "Las perlas se forman cuando un irritante, como un grano de arena, queda atrapado dentro de un bivalvo. El animal lo recubre con capas de nácar para protegerse, creando la gema preciosa.", "agriculturalImportance": "Son de gran importancia en la acuicultura para consumo humano.", "imagen": "images/bivalvia.jpg" },
                { "name": "Cephalopoda", "commonName": "Cefalópodos", "level": "Clase", "icon": "🐙", "description": "Incluye pulpos, calamares y sepias. Son los moluscos más complejos, con un sistema nervioso avanzado, ojos complejos y la capacidad de cambiar de color.", "funFact": "Los pulpos tienen tres corazones y sangre azul. Su sangre usa hemocianina, una proteína a base de cobre, para transportar oxígeno, lo que le da un color azulado.", "agriculturalImportance": "Importantes para la pesca comercial a nivel mundial.", "imagen": "images/cephalopoda.jpg" }
            ]
        },
        {
            "name": "Echinodermata", "commonName": "Equinodermos", "level": "Filo", "icon": "⭐", "description": "Animales marinos con simetría radial (generalmente pentámera) en estado adulto y un esqueleto interno de placas calcáreas. Su nombre significa 'piel espinosa'.", "funFact": "Los equinodermos no tienen sangre. Utilizan un sistema vascular acuífero, una red de canales llenos de agua de mar que usan para la locomoción, la alimentación y la respiración.", "tooltipText": "Importantes en el equilibrio ecológico marino.", "imagen": "images/echinodermata.jpg",
            "children": [
                { "name": "Asteroidea", "commonName": "Estrellas de mar", "level": "Clase", "icon": "⭐", "description": "Cuerpo aplanado con cinco o más brazos que radian de un disco central. Tienen la capacidad de regenerar brazos perdidos.", "funFact": "Para comer, una estrella de mar puede sacar su estómago fuera de su cuerpo a través de su boca, envolver a su presa (como una almeja), digerirla externamente y luego reabsorber el estómago.", "importanciaAgricola": "Sin relevancia directa.", "imagen": "images/asteroidea.jpg" },
                { "name": "Echinoidea", "commonName": "Erizos de mar", "level": "Clase", "icon": "⚫", "description": "Cuerpo globular o discoidal cubierto de espinas móviles. Se alimentan raspando algas de las rocas con una compleja estructura bucal llamada 'linterna de Aristóteles'.", "funFact": "Algunas especies de erizos de mar pueden vivir más de 200 años, lo que los convierte en uno de los animales más longevos del planeta.", "importanciaAgricola": "Sin relevancia directa.", "imagen": "images/echinoidea.jpg" }
            ]
        },
        { 
            "name": "Nematoda", "commonName": "Nematodos", "level": "Filo", "icon": "🦠", "description": "Gusanos redondos no segmentados. Es un filo extremadamente abundante, con especies de vida libre en el suelo y agua, así como importantes parásitos de plantas y animales.", "funFact": "Algunos nematodos pueden entrar en un estado de animación suspendida llamado criptobiosis, permitiéndoles sobrevivir a condiciones extremas de sequía o congelación durante años.", "agriculturalImportance": "De gran importancia. Incluye plagas devastadoras que atacan las raíces de los cultivos (ej. *Meloidogyne*), pero también especies beneficiosas usadas en control biológico de insectos.", "tooltipText": "Microscópicos, abundantes en el suelo y vitales en ciclos biogeoquímicos.", "imagen": "images/nematoda.jpg",
            "children": [
                { "name": "Phytoparasites", "commonName": "Fitoparásitos", "level": "Agrupación", "icon": "🌱", "description": "Nematodos que parasitan plantas, causando agallas en las raíces y reduciendo el rendimiento de los cultivos. Son una de las plagas más importantes a nivel mundial.", "funFact": "El nematodo agallador (*Meloidogyne*) induce a las raíces de la planta a formar células gigantes especializadas para alimentarlo, secuestrando los recursos del cultivo.", "importanciaAgricola": "Causan pérdidas millonarias en la agricultura global al reducir la absorción de agua y nutrientes de las plantas.", "imagen": "images/phytoparasites.jpg" }
            ]
        },
        { 
            "name": "Annelida", "commonName": "Anélidos", "level": "Filo", "icon": "🐛", "description": "Gusanos con el cuerpo segmentado en una serie de anillos o metámeros. Incluye a las lombrices de tierra, los poliquetos marinos y las sanguijuelas. Juegan un papel crucial en la ecología del suelo.", "funFact": "Una lombriz de tierra puede regenerar partes perdidas de su cuerpo. Si se corta, la parte de la cabeza a menudo puede regenerar una nueva cola, aunque la cola no puede regenerar una nueva cabeza.", "agriculturalImportance": "Extremadamente beneficiosos. Las lombrices de tierra mejoran la estructura, aireación y fertilidad del suelo, siendo fundamentales para la agricultura sostenible (vermicompostaje).", "tooltipText": "Ingenieros del ecosistema, como las lombrices de tierra.", "imagen": "images/annelida.jpg",
             "children": [
                { "name": "Oligochaeta", "commonName": "Lombrices de tierra", "level": "Agrupación", "icon": "🌍", "description": "Anélidos terrestres cruciales para la salud del suelo. Sus túneles airean la tierra y sus excrementos (humus) son un fertilizante natural de alta calidad.", "funFact": "Charles Darwin pasó 39 años estudiando las lombrices de tierra y concluyó que son uno de los animales más importantes para la historia del planeta por su rol en la formación del suelo fértil.", "importanciaAgricola": "Son la base de la fertilidad de muchos suelos agrícolas, promoviendo la actividad microbiana y la disponibilidad de nutrientes.", "imagen": "images/oligochaeta.jpg" }
            ]
        },
        {
            "name": "Chordata", "commonName": "Cordados", "level": "Filo", "icon": "🧬", "description": "Filo al que pertenecen los seres humanos. Se caracterizan por presentar, al menos en alguna fase de su vida, una notocorda, un cordón nervioso dorsal hueco y hendiduras faríngeas.", "funFact": "No todos los cordados son vertebrados. Grupos como los tunicados (ascidias) son cordados marinos que en su etapa adulta pierden la notocorda y parecen más una esponja que un animal emparentado con nosotros.", "tooltipText": "Animales con notocorda, incluyendo todos los vertebrados.", "imagen": "images/chordata.jpg",
            "children": [
                { "name": "Chondrichthyes", "commonName": "Peces cartilaginosos", "level": "Clase", "icon": "🦈", "description": "Incluye a los tiburones, rayas y quimeras. Su esqueleto está compuesto de cartílago en lugar de hueso, lo que lo hace más ligero y flexible.", "funFact": "Los tiburones tienen un 'sexto sentido' llamado electrorrecepción. Usan órganos especiales llamados ampollas de Lorenzini para detectar los campos eléctricos generados por los músculos de sus presas.", "tooltipText": "Esqueleto de cartílago, como los tiburones y rayas.", "importanciaAgricola": "Sin relevancia directa.", "imagen": "images/chondrichthyes.jpg" },
                { "name": "Osteichthyes", "commonName": "Peces óseos", "level": "Clase", "icon": "🐠", "description": "Constituyen la gran mayoría de los peces. Poseen un esqueleto óseo y una vejiga natatoria, un órgano lleno de gas que les ayuda a controlar su flotabilidad.", "funFact": "El pez payaso, famoso por la película 'Buscando a Nemo', puede cambiar de sexo. Todos nacen machos, y si la hembra dominante del grupo muere, el macho más grande se transforma en hembra.", "tooltipText": "La mayoría de los peces, con esqueleto de hueso.", "importanciaAgricola": "Base de la pesca comercial y la acuicultura a nivel mundial.", "imagen": "images/osteichthyes.jpg" },
                { "name": "Aves", "commonName": "Aves", "level": "Clase", "icon": "🐦", "description": "Vertebrados endotermos caracterizados por tener el cuerpo cubierto de plumas, un pico sin dientes y las extremidades anteriores modificadas como alas.", "funFact": "Para volar, las aves tienen huesos huecos, lo que los hace extremadamente ligeros. El esqueleto de una fragata, un ave con una envergadura de más de 2 metros, ¡puede pesar menos que el total de sus plumas!", "agriculturalImportance": "Rol dual. Muchas son controladoras de plagas de insectos y roedores, pero otras pueden dañar cultivos de granos y frutas.", "tooltipText": "Descendientes de los dinosaurios, adaptados para el vuelo.", "imagen": "images/aves.jpg" },
                { "name": "Mammalia", "commonName": "Mamíferos", "level": "Clase", "icon": "🐾", "description": "Vertebrados que se caracterizan por la presencia de glándulas mamarias, pelo y ser de 'sangre caliente'. Se han adaptado a casi todos los hábitats del planeta.", "funFact": "El ornitorrinco es uno de los pocos mamíferos venenosos. Los machos tienen un espolón en sus patas traseras que puede inyectar un veneno lo suficientemente potente como para causar un dolor intenso en los humanos.", "agriculturalImportance": "Incluye al ganado doméstico (vacas, ovejas, cerdos), fundamental para la producción de alimentos, y también a plagas como los roedores que dañan granos almacenados.", "tooltipText": "Con pelo y glándulas mamarias para alimentar a sus crías.", "imagen": "images/mammalia.jpg" }
            ]
        }
    ]
}
